Белгипрозем_2017/src/InformationRegisters/СведенияОбИсполнителяхЗадач/СведенияОбИсполнителяхЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОбИсполнителяхЗадач</name>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныйобъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/СведенияОбИсполнителяхЗадач/ManagerModule.bsl
// Возвращает массив исполнителей указанной задачи
Функция ПолучитьИсполнителей(ЗадачаСсылка) Экспорт
	
	Набор = РегистрыСведений.СведенияОбИсполнителяхЗадач.СоздатьНаборЗаписей();
	Набор.Отбор.Задача.Установить(ЗадачаСсылка);
	Набор.Прочитать();
	
	Результат = Новый Массив;
	
	Для каждого Запись Из Набор Цикл
		
		Результат.Добавить( 
			Новый Структура("Участник, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации",
				Запись.Участник, Запись.ОсновнойОбъектАдресации, Запись.ДополнительныйОбъектАдресации));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
